# MySQL

百度百科MySQL

https://baike.baidu.com/item/mySQL/471251?fr=aladdin



MySQL教程

http://www.runoob.com/mysql/mysql-tutorial.html

看了一本书《SQL入门经典》BeginningSQL（很基础）

20181025——20181026

这一部分代码都很短我就全部写在一起了

另外，jupyter只是一个记录代码载体，这些代码都是不能再python环境下运行的

In [2]:
# 175.Combine Two Tables

# Write your MySQL query statement below

SELECT Person.FirstName, Person.LastName, Address.City, Address.State from Person LEFT JOIN Address ON Person.PersonId=Address.PersonId

In [ ]:
# 176.Second Highest Salary

# Write your MySQL query statement below

SELECT
    (SELECT DISTINCT
        Salary 
    FROM
        Employee
    ORDER BY Salary DESC
    LIMIT 1 OFFSET 1)AS SecondHighestSalary

MySQL列的别名

要给列添加别名，可以使用AS关键词后跟别名。因为AS关键字是可选的，可以在语句中省略它。

https://www.yiibai.com/mysql/alias.html

In [ ]:
# 181.Employees Earning More Than Their Managers

# Write your MySQL query statement below

select a.name as Employee
from Employee a inner join Employee b 
on a.managerId = b.id where a.salary>b.salary;

In [ ]:
# 182.Duplicate Emails

# Write your MySQL query statement below

select Email
from Person
group by Email
having Count(*)>1

In [ ]:
# 183.Customers Who Never Order
# Write your MySQL query statement below

SELECT NAME AS CUSTOMERS
FROM CUSTOMERS LEFT JOIN ORDERS
ON CUSTOMERS.ID =ORDERS.CUSTOMERID
WHERE CUSTOMERID IS NULL

In [ ]:
# 196.Delete Duplicate Emails 
# Write your MySQL query statement below

delete p1
from person p1, person p2
where p1.email=p2.email and p1.id>p2.id

In [ ]:
# 197.Rising Temperature
# Write your MySQL query statement below

select w2.id
from weather w1 join weather w2
#on datediff( w2.recorddate , w1.recorddate)=1# this datediff function is important
ON TO_DAYS(w1.recorddate) = TO_DAYS(w2.recorddate) - 1# or use to_days to transform
where w1.temperature<w2.temperature

In [ ]:
# 595.Big Countries 
# Write your MySQL query statement below

select name,population,area
from world
where area>3000000 or population > 25000000

In [ ]:
# 596.Classes More Than 5 Students
# Write your MySQL query statement below

select class
from courses
group by class
having count(distinct student)>=5

In [ ]:
# 620.Not Boring Movies
# Write your MySQL query statement below

select *
from cinema
where id%2 =1 and description <> 'boring'# not eauel : != , <>  .mod(id,2)=1
order by rating desc

In [ ]:
# 627.Swap Salary
# Write your MySQL query statement below

update salary
set sex = case 
    when sex='m' then 'f'
    else 'm'
end